Autodesk.Revit.DB.OptionalFunctionalityUtils.IsNavisworksExporterAvailable
Checks whether a Navisworks Exporter is available in the installed Revit.
Remarks:
A Navisworks exporter is registered via an external add-in. If no add-in has registered an exporter, this will not be a part of the session.
Returns:
True if a Navisworks Exporter is available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsIFCAvailable
Checks whether IFC functionality is available in the installed Revit.
Remarks:
IFC Import/Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the IFC functionality is available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsShapeImporterAvailable
Checks whether the ShapeImporter functionality is available in the installed Revit.
Returns:
True if the ShapeImporter functionality is available in the installed Revit.
Since:
2016

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSKPImportLinkAvailable
Checks whether the SKP Import/Link functionality is available in the installed Revit.
Remarks:
SKP Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the SKP Import/Link functionality is available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSATImportLinkAvailable
Checks whether the SAT Import/Link functionality is available in the installed Revit.
Remarks:
SAT Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the SAT Import/Link functionality is available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNImportLinkAvailable
Checks whether the DGN Import/Link functionality is available in the installed Revit.
Remarks:
DGN Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the DGN Import/Link functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNExportAvailable
Checks whether the DGN Export functionality is available in the installed Revit.
Remarks:
DGN Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the DGN Export functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWFExportAvailable
Checks whether the DWF/DWFx Export functionality is available in the installed Revit.
Remarks:
DWF/DWFx Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the DWF/DWFx Export functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGImportLinkAvailable
Checks whether the DWG Import/Link functionality is available in the installed Revit.
Remarks:
DWG Import/Link is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the DWG Import/Link functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDXFExportAvailable
Checks whether the DXF Export functionality is available in the installed Revit.
Remarks:
DXF Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the DXF Export functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGExportAvailable
Checks whether the DWG Export functionality is available in the installed Revit.
Remarks:
DWG Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the DWG Export functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsFBXExportAvailable
Checks whether the FBX Export functionality is available in the installed Revit.
Remarks:
FBX Export requires presence of certain modules that are optional and may not be part of the installed Revit.
Returns:
True if the FBX Export functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils.IsGraphicsAvailable
Checks whether the graphics functionality is available to support display, print, and export functionality.
Remarks:
Graphics functionality is optional functionality that does not have to be part of the Revit installation.
Returns:
True if the Graphics functionality is available in the installed Revit.

Autodesk.Revit.DB.OptionalFunctionalityUtils
A collection of utilities that can be used to determine if a particular set of functionality is installed and available.